Конфигурация/BusinessProcesses/ОбменПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ОбменПаев</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокПайщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ПогашениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПайщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПогашенияПаев</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПогашенияПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗачислениеПаев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПаев</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВладения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНадбавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/BusinessProcesses/ОбменПаев/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	// Заполняем только на основании заявок на приобретение паев	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		ЭтотОбъект.Основание	= ДанныеЗаполнения;
		ЭтотОбъект.Дата 		= ТекущаяДата();
		
		РеквизитыОснования		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Пайщик");
		ЭтотОбъект.Организация	= РеквизитыОснования.Организация;
		ЭтотОбъект.Пайщик		= РеквизитыОснования.Пайщик;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
		
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.Основание;
		Задача.Организация		  = ЭтотОбъект.Организация;
		
	КонецЦикла;
	
				
КонецПроцедуры

Процедура ОтправкаВДКЗаявкиНаОбменПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, ПаевойИнвестиционныйФонд");
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Выгрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		РеквизитыЗаявки.Дата,
		РеквизитыЗаявки.ПаевойИнвестиционныйФонд,
		Задача);
	
КонецПроцедуры

Процедура ОтправкаВДКЗаявкиНаОбменПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ТребуетсяЗакрытиеЛицевогоСчетаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ОткрытьЗакрытьДепозитарныйСчет");
	
КонецПроцедуры

Процедура ЗагрузкаДанныхОтДКПоОбменуПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаДанныхОтДКПоОбменуПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, ПаевойИнвестиционныйФонд");
	
	Обработки.ОбменДаннымиСДКРегион.ЗагрузитьДанныеОтДКРегион(
		ЭтотОбъект.Организация,
		РеквизитыЗаявки.Дата,
		РеквизитыЗаявки.ПаевойИнвестиционныйФонд,
		Задача,
		Отказ);
		
КонецПроцедуры

Процедура ОтправкаДанныхВЛККОбОбменеПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаДанныхВЛККОбОбменеПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	// Нужно выгрузить данные по двум ПИФам: на погашение и зачисление паев
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПогашениеПаев.Ссылка КАК Погашение,
		|	ЗачислениеПаев.Ссылка КАК Зачисление,
		|	ПогашениеПаев.Заявка.НомерЗаявки КАК НомерЗаявки
		|ИЗ
		|	Документ.ПогашениеПаев КАК ПогашениеПаев
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ЗачислениеПаев
		|		ПО ПогашениеПаев.Организация = ЗачислениеПаев.Организация
		|			И ПогашениеПаев.Заявка = ЗачислениеПаев.Заявка
		|			И ПогашениеПаев.Пайщик = ЗачислениеПаев.Пайщик
		|			И (ЗачислениеПаев.Проведен)
		|ГДЕ
		|	ПогашениеПаев.Организация = &Организация
		|	И ПогашениеПаев.Пайщик = &Пайщик
		|	И ПогашениеПаев.Заявка = &Заявка
		|	И ПогашениеПаев.Проведен");
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Заявка",			ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Пайщик",			ЭтотОбъект.Пайщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
				
		ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
		
		ОбменСЛКК.Организация = ЭтотОбъект.Организация;
		
		ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
		
		// Погашение
		ОбменСЛКК.ВыгрузитьОперацииПоПаям(Выборка.Погашение, Выборка.НомерЗаявки + "_S", Отказ);
		
		Если Отказ Тогда
			// ##Оповещение
			Возврат;
		КонецЕсли;
		
		// Зачисление
		ОбменСЛКК.ВыгрузитьОперацииПоПаям(Выборка.Зачисление, Выборка.НомерЗаявки + "_B", Отказ);
		
		Если Отказ Тогда
			// ##Оповещение
			Возврат;
		КонецЕсли;
		
		// Меняем и выгружаем статус заявки
		РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
			ЭтотОбъект.Организация,
			ЭтотОбъект.Основание,
			Перечисления.СтатусыЗаявокПайщиков.Исполнена,
			ТекущаяДатаСеанса(),
			Отказ);			
			
		Если Отказ Тогда
			// ##Оповещение
			Возврат;
		КонецЕсли;
		
		ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "done", Отказ);
	
	Иначе
		// ##Оповещение
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормированиеВыводаДенежныхСредствВПИФПоОбменуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
    ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаВЛККСтатусаВРаботеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаВЛККСтатусаВРаботеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
			ЭтотОбъект.Организация,
			ЭтотОбъект.Основание,
			Перечисления.СтатусыЗаявокПайщиков.ВРаботе,
			ТекущаяДатаСеанса(),
			Отказ);
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
			
	// Также устанавливаем статус у связанной заявки на приобретение (если она есть)	
	ЗаявкаНаПриобретение = Бизнеспроцессы.ОбменПаев.ЗаявкаНаПриобретениеПоЗаявкеНаОбменПаев(ЭтотОбъект.Организация, ЭтотОбъект.Основание);
		
	Если ЗаявкаНаПриобретение <> Неопределено Тогда
				
		РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
			ЭтотОбъект.Организация,
			ЗаявкаНаПриобретение,
			Перечисления.СтатусыЗаявокПайщиков.ВРаботе,
			ТекущаяДатаСеанса(),
			Отказ);
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
	
	ОбменСЛКК.Организация = ЭтотОбъект.Организация;
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "in_process", Отказ); 
			
КонецПроцедуры


Процедура ОтправкаЗаявленияНаОткрытиеСчетаИЗаявокПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, ПаевойИнвестиционныйФонд");
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Выгрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		РеквизитыЗаявки.Дата,
		РеквизитыЗаявки.ПаевойИнвестиционныйФонд,
		Задача);

КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, ПаевойИнвестиционныйФонд");
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Загрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		РеквизитыЗаявки.Дата,
		РеквизитыЗаявки.ПаевойИнвестиционныйФонд,
		Задача);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
					
	// Установим статус у заявки на приобретение
	ЗаявкаНаПриобретение = Бизнеспроцессы.ОбменПаев.ЗаявкаНаПриобретениеПоЗаявкеНаОбменПаев(ЭтотОбъект.Организация, ЭтотОбъект.Основание);
		
	Если ЗаявкаНаПриобретение = Неопределено Тогда				
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	РегистрыСведений.СтатусыЗаявокПайщиков.УстановитьСтатусЗаявки(
		ЭтотОбъект.Организация,
		ЗаявкаНаПриобретение,
		Перечисления.СтатусыЗаявокПайщиков.Исполнена,
		ТекущаяДатаСеанса(),
		Отказ);			
					
КонецПроцедуры

Процедура ТребуетсяОткрытиеЛицевогоСчетаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена");
	
КонецПроцедуры

Процедура ОтправкаЗаявленияНаОткрытиеСчетаИЗаявокПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаУведомленияОбОткрытииСчетаВЛККПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаУведомленияОбОткрытииСчетаВЛККПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
     	
	// Ищем файлы (нужны pdf и sig)
	ПрикрепленныеФайлы = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(ЭтотОбъект.Основание);
	
	Если ПрикрепленныеФайлы.Количество() = 0 Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
		Возврат;
	КонецЕсли;
    	
	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
		
	ОбменСЛКК.Организация = ЭтотОбъект.Организация;
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
		
	ЕстьФайлы = Ложь;
	Для Каждого ПрикрепленныйФайл Из ПрикрепленныеФайлы Цикл
			
		Если СтрНачинаетсяС(ПрикрепленныйФайл.Наименование, "Уведомление об открытии лицевого счета")
			И (ПрикрепленныйФайл.Расширение = "pdf"
				Или ПрикрепленныйФайл.Расширение = "sig") Тогда
			ФайлУведомления = РаботаСФайловымХранилищем.ПолучитьФайл(ПрикрепленныйФайл.ИдентификаторФайла);
			ОбменСЛКК.ВыгрузитьФайлы(ЭтотОбъект.Основание,
						ФайлУведомления.Адрес,
						ПрикрепленныйФайл.Наименование + "." + ПрикрепленныйФайл.Расширение,
						ПрикрепленныйФайл.Наименование,
						Отказ);
			ЕстьФайлы = Истина;			
		КонецЕсли;
		
		Если Отказ Тогда
			//##Зарегистрировать ошибку
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьФайлы Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
	КонецЕсли;
     
КонецПроцедуры
